Tekla.Structures.DialogInternal.dotdiaAttributeFieldType_e
Further specification of the TS Object Dialog tree field type

Tekla.Structures.DialogInternal.dotdiaAttributeFieldType_e.Number
The attribute is a number

Tekla.Structures.DialogInternal.dotdiaAttributeFieldType_e.Text
The attribute is textual